# LeaderLeftAttachment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNote..::..LeaderLeftAttachment Property
TextNote Class See Also
---
Attachment position of leaders on the left side of the text note.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public LeaderAtachement LeaderLeftAttachment { get; set; }
```

Visual Basic
---
```text
Public Property LeaderLeftAttachment As LeaderAtachement
	Get
	Set
```

Visual C++
---
```text
public:
property LeaderAtachement LeaderLeftAttachment {
	LeaderAtachement get ();
	void set (LeaderAtachement value);
}
```

# Remarks
The property controls the vertical position of leaders attached to the left side of the note.
Change of the value will affect all leaders currently attached to the left side.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TextNote Class
Autodesk.Revit.DB Namespace